In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

#### Binarization

In [2]:
df = pd.read_csv('Social_Network_Ads.csv')

df

In [4]:
from sklearn.preprocessing import Binarizer

In [5]:
bnr = Binarizer(threshold=75000)

In [6]:
df['EstimatedSalary'] = bnr.fit_transform([df['EstimatedSalary']])[0]

In [7]:
df

      User ID  Gender   Age  EstimatedSalary  Purchased
0    15624510    Male  19.0              0.0          0
1    15810944    Male  35.0              0.0          0
2    15668575  Female  26.0              0.0          0
3    15603246  Female  27.0              0.0          0
4    15804002    Male  19.0              1.0          0
..        ...     ...   ...              ...        ...
395  15691863  Female  46.0              0.0          1
396  15706071    Male  51.0              0.0          1
397  15654296  Female  50.0              0.0          1
398  15755018    Male  36.0              0.0          0
399  15594041  Female  49.0              0.0          1

[400 rows x 5 columns]

In [8]:
df['EstimatedSalary'].values

array([0., 0., 0., 0., 1., 0., 1., 1., 0., 0., 1., 0., 1., 0., 1., 1., 0.,
       0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 1., 0., 0.,
       1., 0., 0., 0., 0., 0., 0., 0., 1., 0., 1., 0., 1., 0., 1., 1., 0.,
       0., 1., 0., 0., 0., 0., 1., 0., 1., 0., 1., 0., 1., 1., 0., 0., 1.,
       0., 0., 1., 0., 0., 1., 0., 1., 0., 0., 1., 0., 1., 0., 0., 1., 0.,
       1., 0., 1., 1., 0., 1., 1., 0., 0., 1., 0., 0., 1., 0., 0., 1., 0.,
       1., 1., 0., 0., 0., 1., 1., 1., 0., 0., 0., 0., 1., 0., 0., 0., 0.,
       0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 1., 0., 0., 1., 0., 0., 0.,
       1., 1., 0., 0., 1., 0., 0., 1., 0., 1., 1., 0., 0., 0., 0., 0., 1.,
       0., 0., 0., 0., 0., 0., 1., 1., 1., 0., 0., 0., 1., 0., 0., 1., 0.,
       1., 1., 1., 0., 0., 0., 0., 0., 0., 0., 0., 0., 1., 0., 0., 0., 1.,
       0., 0., 0., 1., 0., 0., 0., 1., 0., 1., 0., 1., 0., 0., 0., 1., 0.,
       1., 0., 1., 1., 1., 0., 1., 1., 0., 0., 0., 1., 0., 1., 1., 1., 1.,
       1., 1., 1., 0., 0., 1., 1., 0., 1., 1., 0., 1., 1., 1., 1., 0., 1.,
       1., 1., 1., 0., 1., 1., 0., 1., 0., 1., 0., 1., 0., 0., 1., 1., 0.,
       1., 0., 0., 1., 1., 1., 1., 1., 0., 1., 1., 0., 0., 1., 0., 1., 1.,
       0., 1., 0., 0., 0., 1., 0., 0., 1., 0., 0., 0., 1., 1., 0., 1., 1.,
       1., 1., 1., 0., 1., 0., 0., 0., 1., 1., 1., 0., 0., 1., 1., 0., 0.,
       1., 1., 1., 0., 0., 1., 0., 1., 1., 0., 1., 0., 0., 0., 1., 1., 0.,
       0., 1., 0., 0., 0., 1., 1., 0., 1., 0., 0., 0., 0., 1., 1., 0., 1.,
       1., 0., 0., 0., 1., 0., 0., 1., 1., 0., 1., 0., 1., 0., 1., 0., 0.,
       0., 0., 0., 1., 0., 0., 1., 1., 0., 0., 1., 0., 0., 0., 1., 0., 1.,
       1., 0., 0., 0., 1., 0., 0., 0., 1., 0., 0., 0., 0., 0., 0., 0., 0.,
       0., 0., 0., 0., 0., 0., 0., 0., 0.])

In [9]:
bna= Binarizer(threshold=40)

In [10]:
df['Age']=bna.fit_transform([df['Age']])[0]

In [11]:
df

      User ID  Gender  Age  EstimatedSalary  Purchased
0    15624510    Male  0.0              0.0          0
1    15810944    Male  0.0              0.0          0
2    15668575  Female  0.0              0.0          0
3    15603246  Female  0.0              0.0          0
4    15804002    Male  0.0              1.0          0
..        ...     ...  ...              ...        ...
395  15691863  Female  1.0              0.0          1
396  15706071    Male  1.0              0.0          1
397  15654296  Female  1.0              0.0          1
398  15755018    Male  0.0              0.0          0
399  15594041  Female  1.0              0.0          1

[400 rows x 5 columns]

In [12]:
###cross validation

In [13]:
df = pd.read_csv('Social_Network_Ads.csv')

In [14]:
df

      User ID  Gender   Age  EstimatedSalary  Purchased
0    15624510    Male  19.0          19000.0          0
1    15810944    Male  35.0          20000.0          0
2    15668575  Female  26.0          43000.0          0
3    15603246  Female  27.0          57000.0          0
4    15804002    Male  19.0          76000.0          0
..        ...     ...   ...              ...        ...
395  15691863  Female  46.0          41000.0          1
396  15706071    Male  51.0          23000.0          1
397  15654296  Female  50.0          20000.0          1
398  15755018    Male  36.0          33000.0          0
399  15594041  Female  49.0          36000.0          1

[400 rows x 5 columns]

In [15]:
df.shape

(400, 5)

In [16]:
df = pd.read_csv('Social_Network_Ads.csv')

In [18]:
from sklearn.model_selection import train_test_split

In [19]:
train, test = train_test_split(df)

In [20]:
train

      User ID  Gender   Age  EstimatedSalary  Purchased
355  15606472    Male  60.0          34000.0          1
284  15638646    Male  48.0         141000.0          0
220  15789432  Female  41.0          80000.0          0
21   15736760  Female  47.0          49000.0          1
195  15667742    Male  34.0          43000.0          0
..        ...     ...   ...              ...        ...
303  15637593    Male  37.0          79000.0          1
137  15687491    Male  30.0         107000.0          1
87   15631912  Female  28.0          85000.0          0
134  15800061  Female  28.0          55000.0          0
43   15792008    Male  30.0          15000.0          0

[300 rows x 5 columns]

In [21]:
test

      User ID  Gender   Age  EstimatedSalary  Purchased
226  15795224  Female  36.0         126000.0          1
294  15566689  Female  35.0          57000.0          0
57   15807481    Male  28.0          79000.0          0
92   15809823    Male  26.0          15000.0          0
374  15793890  Female  37.0          80000.0          0
..        ...     ...   ...              ...        ...
158  15762605    Male  26.0          30000.0          0
386  15724150  Female  49.0          39000.0          1
196  15738448  Female  30.0          79000.0          0
302  15720745  Female  37.0         137000.0          1
119  15701962    Male  41.0          59000.0          0

[100 rows x 5 columns]

In [22]:
train, test = train_test_split(df, random_state=0)

In [23]:
train

      User ID  Gender   Age  EstimatedSalary  Purchased
250  15810075  Female  44.0          39000.0          0
63   15583681    Male  32.0         120000.0          1
312  15733964  Female  38.0          50000.0          0
159  15598840  Female  32.0         135000.0          1
283  15663249  Female  52.0          21000.0          1
..        ...     ...   ...              ...        ...
323  15619465  Female  48.0          30000.0          1
192  15779581    Male  29.0          43000.0          0
117  15591433    Male  36.0          52000.0          0
47   15776348  Female  27.0          54000.0          0
172  15794661  Female  26.0         118000.0          0

[300 rows x 5 columns]

In [24]:
test

      User ID  Gender   Age  EstimatedSalary  Purchased
132  15725660    Male  30.0          87000.0          0
309  15652400  Female  38.0          50000.0          0
341  15776844    Male  35.0          75000.0          0
196  15738448  Female  30.0          79000.0          0
246  15638003  Female  35.0          50000.0          0
..        ...     ...   ...              ...        ...
146  15750839  Female  27.0          96000.0          1
135  15578006    Male  23.0          63000.0          0
390  15807837    Male  48.0          33000.0          1
264  15600379    Male  48.0          90000.0          1
364  15654456    Male  42.0         104000.0          1

[100 rows x 5 columns]

In [25]:
train, test = train_test_split(df, random_state=0, test_size=0.20)

In [26]:
train.shape

(320, 5)

In [27]:
test.shape

(80, 5)

In [28]:
x = df[['Age','EstimatedSalary']]
y=df['Purchased']

In [30]:
y.value_counts()/len(y)

Purchased
0    0.6425
1    0.3575
Name: count, dtype: float64

In [32]:
x_train, x_test,y_train, y_test = train_test_split(x,y, random_state=0)

In [33]:
x_train.shape

(300, 2)

In [35]:
y_train.shape

(300,)

In [36]:
y_train.value_counts()/len(y_train)

Purchased
0    0.63
1    0.37
Name: count, dtype: float64

In [38]:
y_test.value_counts()/len(y_test)

Purchased
0    0.68
1    0.32
Name: count, dtype: float64

In [39]:
x_train, x_test,y_train, y_test = train_test_split(x,y, random_state=0, stratify=y)

In [40]:
y_train.value_counts()/len(y_train)

Purchased
0    0.643333
1    0.356667
Name: count, dtype: float64

In [41]:
y_test.value_counts()/len(y_test)

Purchased
0    0.64
1    0.36
Name: count, dtype: float64